import { createSlice } from '@reduxjs/toolkit';
import {
  Twitter,
  LinkedIn,
  Facebook,
  Instagram,
  DifferenceOutlined,
  PeopleAltOutlined,
  QuestionAnswerOutlined,
  VerifiedUserOutlined,
  BusinessCenterOutlined,
  PersonOutlineOutlined,
} from '@mui/icons-material';
import { v4 as uuidv4 } from 'uuid';

export const constantsSlice = createSlice({
  name: 'constants',
  initialState: {
    value: {
      navLinks: [
        { title: 'الرئيسية', href: '/' },
        { title: 'وظائف', href: '/jobs' },
        { title: 'مستقلين', href: '/freelancers' },
        { title: 'صاحب عمل', href: '/comingsoon' },
      ],
      footerLinks: [
        { title: 'الرئيسية', href: '/' },
        { title: 'وظائف', href: '/jobs' },
        { title: 'مستقلين', href: '/freelancers' },
        { title: 'صاحب عمل', href: '/comingsoon' }
      ],
      footerIcons: (color) => [
        <Instagram key={0} sx={{ color: color, cursor: 'pointer' }} />,
        <LinkedIn key={1} sx={{ color: color, cursor: 'pointer' }} />,
        <Twitter key={2} sx={{ color: color, cursor: 'pointer' }} />,
        <Facebook key={3} sx={{ color: color, cursor: 'pointer' }} />,
      ],
      heroButtons: [
        'تصميم',
        'برمجة',
        'تسويق',
        'ترجمة و صوتيات',
        'إدخال بيانات',
        'شاهد المزيد',
      ],
      featuresIcons: (color) => [
        {
          icon: (
            <VerifiedUserOutlined sx={{ fontSize: '45px', color: color }} />
          ),
          title: 'ضمان الدفع الأمن ',
        },
        {
          icon: (
            <QuestionAnswerOutlined sx={{ fontSize: '45px', color: color }} />
          ),
          title: 'تواصل مع المستقلين',
        },
        {
          icon: <PeopleAltOutlined sx={{ fontSize: '45px', color: color }} />,
          title: 'أختر الكوادر المميزة',
        },
        {
          icon: <DifferenceOutlined sx={{ fontSize: '45px', color: color }} />,
          title: 'أنشر الوظيفة',
        },
      ],
      freelancersCards: [
        { title: 'المستقل الأول', body: 'التوصيف الأول' },
        { title: 'المستقل الثانى', body: 'التوصيف الثانى' },
        { title: 'المستقل الثالث', body: 'التوصيف الثالث' },
        { title: 'المستقل الرابع', body: 'التوصيف الرابع' },
        { title: 'المستقل الخامس', body: 'التوصيف الخامس' },
      ],
      testimonialsCards: [
        { title: 'مصفطفى حمدى', body: 'مستقل مشهور', description: "اكتشفت منصة علمنى مؤخرًا أثناء البحث عن [منتج] معين. لم يكن لديهم فقط العنصر الذي كنت أبحث عنه ، ولكن اختيارهم كان واسعًا ، وكانت الأسعار تنافسية. كان من السهل التنقل في موقع الويب ، وكانت أوصاف المنتج مفيدة ودقيقة." },
        { title: 'عماد الدين', body: 'رجل أعمال', description: "لقد كان العمل علة منصة علمنى من دواعي سروري المطلق. فريقهم من المهنيين المهرة ليس فقط على دراية في مجال عملهم ولكنه مكرس أيضًا لتقديم خدمة ودعم من الدرجة الأولى. لقد أخذوا الوقت الكافي لفهم احتياجاتنا الفريدة وطوروا حلاً مخصصًا تجاوز توقعاتنا." },
        { title: 'خالد شوقى', body: 'خبير إقتصاد', description: "بدأت مؤخرًا في استخدام منصة علمنى ولم أكن منبهرًا بوظائفه وواجهة مستخدم سهلة الاستخدام. لقد أحدث التطبيق تأثيرًا كبيرًا على روتيني اليومي ، حيث قام بتبسيط المهام وتقديم رؤى قيمة. من الواضح أن المطورين بذلوا قدرًا كبيرًا من التفكير والجهد لإنشاء تطبيق من الدرجة الأولى يلبي احتياجات المستخدمين." },
      ],
      summaryStacks: [
        { title: 'مستقل', icon: <PersonOutlineOutlined /> },
        { title: 'مصمم جرافيك', icon: <BusinessCenterOutlined /> },
      ],
      freelancersProjectsCards: [
        {
          id: uuidv4(),
          title: 'لوجو شركة',
          body: 'أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ',
          date: '2023',
        },
        {
          id: uuidv4(),
          title: 'لوجو شركة',
          body: 'أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ',
          date: '2023',
        },
        {
          id: uuidv4(),
          title: 'لوجو شركة',
          body: 'أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ',
          date: '2023',
        },
        {
          id: uuidv4(),
          title: 'لوجو شركة',
          body: 'أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ',
          date: '2023',
        },
        {
          id: uuidv4(),
          title: 'لوجو شركة',
          body: 'أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ',
          date: '2023',
        },
        {
          id: uuidv4(),
          title: 'لوجو شركة',
          body: 'أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ',
          date: '2023',
        },
      ],
      freelancersAboutChips: [
        'سرعة',
        'إتقان',
        'إحتراف',
        'مسئولية',
      ],
      freelancersAvailableCards: [
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. محمد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. محمد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. محمد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. محمد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. زياد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. زياد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. زياد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. زياد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'د. زياد خالد',
          ratings: 5,
          body: 'حاصل على إجازة في الهندسة المعمارية، وطالب ماجستير في التنمية الإقليمية والعمرانية',
        },
      ],
      freelancerRatings: [
        {
          id: uuidv4(),
          avatar: "M",
          title: "محمد خالد",
          ratings: 5,
          job: "مدير شركة",
          time: "2023-05-16",
          description: "شغل ممتاز جدا المشروع على اكمل وجهه سريع في التواصل والردود انصح جدا بالتعامل معه راقي وذو اخلاق"
        },
        {
          id: uuidv4(),
          avatar: "M",
          title: "محمد خالد",
          ratings: 5,
          job: "مدير شركة",
          time: "2023-05-16",
          description: "شغل ممتاز جدا المشروع على اكمل وجهه سريع في التواصل والردود انصح جدا بالتعامل معه راقي وذو اخلاق"
        }
      ],
      jobsCards: [
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لموقع',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لموقع',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لموقع',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لموقع',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لمنزل',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لمنزل',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لمنزل',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لمنزل',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'عمل تصميم لمنزل',
          freelancer: 'د. محمد خالد',
          time: 'منذ 30 دقيقة',
          body: 'أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية',
        },
      ],
      jobsProposers: [
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'أحمد هشام',
          ratings: 4,
          job: 'مستقل',
          price: 500,
          time: 3,
          body: 'السلام عليكم معكم أنا خبير في الووردبريس مدة ١٥ عام لدي سجل طويل بمشاريع تسريع ووردبريس وجميعها ناجحة والحمد لله يمكنكم الاطلاع على سجلي في مستقل ي...',
        },
        {
          id: uuidv4(),
          avatar: 'M',
          title: 'مصطفى عبد الحميد',
          ratings: 3,
          job: 'مستقل',
          price: 350,
          time: 1,
          body: 'السلام عليكم معكم أنا لدي خبرة بمشاريع كثيرة وجميعها ناجحة...',
        }
      ],
    },
  },
  reducers: {
    addJobsProposer: (state, action) => {
      state.value.jobsProposers.push(action.payload.value);
    },
    addFreelancerRatings: (state, action) => {
      state.value.freelancerRatings.push(action.payload.value);
    }
  }
});

export const { addJobsProposer, addFreelancerRatings } = constantsSlice.actions;
export default constantsSlice.reducer;
