import { createSlice } from "@reduxjs/toolkit";

export const filtersSlice = createSlice({
    name: "filters",
    initialState: {
        value: {
            jobsCards: {
                allCards: [
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"}
                ], filteredCards: [
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لموقع", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"},
                    {avatar: "M", title: "عمل تصميم لمنزل", freelancer: "د. محمد خالد", time: "منذ 30 دقيقة", body: "أريد عمل تصميم أحتارفي لموقع الكتروني لعيادة أطفال ، مع وجود خدمة استشارية على الموقع ، وتقييمات على الخدمة ، مع جدول لمواعيد العيادة وأسعارها ، وأمكانية التغيير بين اللغة العربية والانجليزية"}
                ]
            }
        }
    },
    reducers: {
    filterData: (state, action) => {
            state.value.jobsCards.filteredCards = state.value.jobsCards.allCards.filter((card => (
                card.title.toLowerCase().includes(action.payload.title.toLowerCase())
            )))
        }
    }
});

export const { filterData } = filtersSlice.actions;
export default filtersSlice.reducer;